src/Documents/ЗакупкаТоваров/ЗакупкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакупкаТоваров</name>
  <registerRecords>AccumulationRegister.ТоварыНаСкладе</registerRecords>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Закупки</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>CatalogRef.Товары</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ЗакупкаТоваров/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ЗакупкиЦенаПриИзменении(Элемент)
	Товар = Элементы.Закупки.ТекущиеДанные;
	Товар.Сумма = Товар.Цена * Товар.Количество;
КонецПроцедуры

&НаКлиенте
Процедура ЗакупкиКоличествоПриИзменении(Элемент)
	Товар = Элементы.Закупки.ТекущиеДанные;
	Товар.Сумма = Товар.Цена * Товар.Количество;
КонецПроцедуры
